        IDENTIFICATION DIVISION.
        PROGRAM-ID. Admin.

        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT USER-FILE ASSIGN TO "Record.txt"
                ORGANIZATION IS INDEXED
                ACCESS MODE IS RANDOM
                RECORD KEY IS USER-ID.

            SELECT PAYSLIP-FILE ASSIGN TO "Payslip.txt"
                ORGANIZATION IS INDEXED
                ACCESS MODE IS RANDOM
                RECORD KEY IS USERNAME.

        DATA DIVISION.
        FILE SECTION.

        FD USER-FILE.
        01 USER-RECORD.
            02 USER-ID                  PIC X(30).
            02 USER-PASSWORD            PIC X(30).
            02 EMPLOYEE-NAME            PIC X(30).
            02 EMPLOYEE-DOB             PIC X(15).
            02 EMPLOYEE-GENDER          PIC A(10).
            02 EMPLOYEE-MARITAL-STATUS  PIC A(10).
            02 EMPLOYEE-NATIONALITY     PIC A(10).
            02 EMPLOYEE-EMAIL           PIC X(20).
            02 EMPLOYEE-CONTACT         PIC X(12).
            02 EMPLOYEE-ADDRESS         PIC X(40).

        FD PAYSLIP-FILE.
        01 PAYSLIP-RECORD.
            02 USERNAME                 PIC X(30).
            02 PAYSLIP-PERIOD           PIC X(30).
            02 BASIC-SALARY             PIC 9(4).
            02 FD-OVERTIME              PIC Z(6).99.
            02 FD-NIGHT-DIFF            PIC Z(6).99.
            02 FD-HOLIDAY               PIC Z(6).99.
            02 FD-TOTAL-PAY             PIC Z(6).99.
            02 FD-LATE PIC Z(6).99.
            02 FD-ABSENT PIC Z(6).99.
            02 FD-UNDERTIME PIC Z(6).99.
            02 FD-SSS PIC 999.
            02 FD-PAGIBIG PIC 999.
            02 FD-PHILHEALTH PIC 999.
            02 FD-TOTAL-DEDUCTION PIC Z(6).99.
            02 FD-NETPAY PIC Z(6).99.

        WORKING-STORAGE SECTION.
        01 File-Status PIC XX.
            88 File-OK VALUE "00".
            88 File-End VALUE "10".
        01 Start-Key PIC X(30) VALUE SPACES.
        01 CHOICE PIC 9.
        01 WS-CHOICE PIC A(1).
        01 WS-OVERTIME-HOURS PIC 999.
        01 WS-OVERTIME PIC 9(5).
        01 WS-NIGHT-DIFF-HOURS PIC 999.
        01 WS-NIGHT-DIFF PIC 9(5).
        01 WS-HOLIDAY-HOURS PIC 999.
        01 WS-HOLIDAY PIC 9(5).
        01 WS-TOTAL-PAY PIC 9(5).
        01 WS-LATE PIC 999.
        01 WS-LATERES PIC 9(5).
        01 WS-ABSENT PIC 999.
        01 WS-ABSENTRES PIC 9(5).
        01 WS-UNDERTIME PIC 999.
        01 WS-UNDERTIMERES PIC 9(5).
        01 WS-SSS PIC 999 VALUE 225.
        01 WS-PAGIBIG PIC 999 VALUE 200.
        01 WS-PHILHEALTH PIC 999 VALUE 180.
        01 WS-TOTALDEDUCTION PIC 9(5).
        01 WS-NETPAY PIC 9(5).99.

        PROCEDURE DIVISION.
        MAIN-MENU.
        PERFORM UNTIL CHOICE = 6
            DISPLAY "MAIN-MENU"
            DISPLAY "1. VIEW EMPLOYEE RECORDS"
            DISPLAY "2. VIEW EMPLOYEE ATTENDANCE"
            DISPLAY "3. PROCESS EMPLOYEE PAYSLIP"
            DISPLAY "4. BACK TO LOGIN"
            DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING
            ACCEPT CHOICE
            EVALUATE CHOICE
                WHEN 1
                    PERFORM VIEW-RECORDS
                WHEN 2
                    PERFORM VIEW-ATTENDANCE
                WHEN 3
                    PERFORM PROCESS-PAYSLIP
                WHEN 4
                    PERFORM BACK
                WHEN OTHER
                    DISPLAY "INVALID CHOICE"
                    PERFORM MAIN-MENU
            END-EVALUATE
            END-PERFORM
            STOP RUN.

        VIEW-RECORDS.
            OPEN I-O USER-FILE
            PERFORM UNTIL File-End
                READ USER-FILE NEXT
                    AT END
                        SET File-End TO TRUE
                    NOT AT END
                        DISPLAY "Username: " USER-ID
                        DISPLAY "Employee Name: " EMPLOYEE-NAME
                        DISPLAY " "
                END-READ
            END-PERFORM.
            CLOSE USER-FILE
            DISPLAY "ALL RECORDS DISPLAYED."
            PERFORM VIEWING-RECORDS
            STOP RUN.

        VIEWING-RECORDS.
        DISPLAY "ENTER USERNAME YOU WANT TO VIEW: " WITH NO ADVANCING
        ACCEPT USER-ID 

        OPEN I-O USER-FILE
        READ USER-FILE KEY IS USER-ID
            INVALID KEY
                DISPLAY "RECORD NOT FOUND FOR USER-ID: " USER-ID
            NOT INVALID KEY
                DISPLAY "RECORD FOUND:"
                DISPLAY "USER-ID: " USER-ID
                DISPLAY "PASSWORD: " USER-PASSWORD
                DISPLAY "EMPLOYEE NAME: " EMPLOYEE-NAME
                DISPLAY "EMPLOYEE DOB: " EMPLOYEE-DOB
                DISPLAY "EMPLOYEE GENDER: " EMPLOYEE-GENDER
                DISPLAY "EMPLOYEE STATUS: " EMPLOYEE-MARITAL-STATUS
                DISPLAY "EMPLOYEE NATIONALITY: " EMPLOYEE-NATIONALITY
                DISPLAY "EMPLOYEE EMAIL: " EMPLOYEE-EMAIL
                DISPLAY "EMPLOYEE CONTACT: " EMPLOYEE-CONTACT
                DISPLAY "EMPLOYEE ADDRESS: " EMPLOYEE-ADDRESS
        CLOSE USER-FILE

        DISPLAY "DO YOU WANT TO VIEW ANOTHER RECORD? (Y/N)" NO ADVANCING
        ACCEPT WS-CHOICE
        IF WS-CHOICE = "Y" OR WS-CHOICE = "y"
            PERFORM VIEWING-RECORDS
        ELSE
            PERFORM MAIN-MENU
        STOP RUN.

        VIEW-ATTENDANCE.
        CALL "SYSTEM" USING BY REFERENCE "python3 admin-att.py"
        STOP RUN.

        PROCESS-PAYSLIP.
        PERFORM UNTIL CHOICE = 4
        DISPLAY "PROCESSING PAYSLIP"
        DISPLAY "1. ADDITION IN SALARY"
        DISPLAY "2. DEDUCTION IN SALARY"
        DISPLAY "3. GENERATE PAYSLIP"
        DISPLAY "4. BACK"
        DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING
        ACCEPT CHOICE
           EVALUATE CHOICE
            WHEN 1
                PERFORM ADDITION-SALARY
            WHEN 2
                PERFORM DEDUCTION-SALARY
            WHEN 3
                PERFORM PAYSLIP
            WHEN 4
                PERFORM MAIN-MENU
            WHEN OTHER
            DISPLAY "INVALID CHOICE. PLEASE TRY AGAIN."
            PERFORM PROCESS-PAYSLIP
            END-EVALUATE
            END-PERFORM
            STOP RUN.

        ADDITION-SALARY.
        DISPLAY "ENTER USERNAME OF EMPLOYEE: " WITH NO ADVANCING
        ACCEPT USERNAME

        OPEN I-O PAYSLIP-FILE
           READ PAYSLIP-FILE KEY IS USERNAME
           INVALID KEY
                   DISPLAY "EMPLOYEE NOT FOUND"
                   CLOSE PAYSLIP-FILE
                   EXIT
               NOT INVALID KEY

        MOVE 9720 TO BASIC-SALARY

        DISPLAY "ENTER OVERTIME PAY HOURS: " 
        WITH NO ADVANCING
        ACCEPT WS-OVERTIME-HOURS
        MULTIPLY WS-OVERTIME-HOURS BY 97.2
        GIVING WS-OVERTIME
        MOVE WS-OVERTIME TO FD-OVERTIME

        DISPLAY "ENTER NIGHT DIFFERENTIAL HOURS: " WITH NO ADVANCING
        ACCEPT WS-NIGHT-DIFF-HOURS
        MULTIPLY WS-NIGHT-DIFF-HOURS BY 105.3 GIVING
        WS-NIGHT-DIFF
        MOVE WS-NIGHT-DIFF TO FD-NIGHT-DIFF
        
        DISPLAY "ENTER HOLIDAY HOURS: " WITH NO ADVANCING
        ACCEPT WS-HOLIDAY-HOURS
        MULTIPLY WS-HOLIDAY-HOURS BY 162 GIVING WS-HOLIDAY
        MOVE WS-HOLIDAY TO FD-HOLIDAY

        COMPUTE WS-TOTAL-PAY = WS-OVERTIME + WS-NIGHT-DIFF +
        WS-HOLIDAY + BASIC-SALARY
        MOVE WS-TOTAL-PAY TO FD-TOTAL-PAY
            
            REWRITE PAYSLIP-RECORD
               INVALID KEY
                   DISPLAY "ERROR: NO RECORD FOUND"
           END-REWRITE
           DISPLAY "RECORDED SUCCESSFULLY"
           END-READ.
           CLOSE PAYSLIP-FILE.

        DEDUCTION-SALARY.
        DISPLAY "ENTER USERNAME OF EMPLOYEE: " WITH NO ADVANCING
        ACCEPT USERNAME

           OPEN I-O PAYSLIP-FILE
           READ PAYSLIP-FILE KEY IS USERNAME
           INVALID KEY
                   DISPLAY "EMPLOYEE NOT FOUND"
                   CLOSE PAYSLIP-FILE
                   EXIT
               NOT INVALID KEY

        DISPLAY "ENTER LATE(MINUTES): " 
        WITH NO ADVANCING
        ACCEPT WS-LATE
        COMPUTE WS-LATERES = WS-LATE * 2
        MOVE WS-LATERES TO FD-LATE

        DISPLAY "ENTER DAYS OF ABSENT: " WITH NO ADVANCING
        ACCEPT WS-ABSENT 
        COMPUTE WS-ABSENTRES = WS-ABSENT * 648
        MOVE WS-ABSENTRES TO FD-ABSENT
        
        DISPLAY "ENTER UNDERTIME HOURS: " WITH NO ADVANCING
        ACCEPT WS-UNDERTIME
        COMPUTE WS-UNDERTIMERES = WS-UNDERTIME * 81
        MOVE WS-UNDERTIMERES TO FD-UNDERTIME

        MOVE FD-TOTAL-PAY TO WS-TOTAL-PAY
        MOVE WS-SSS TO FD-SSS
        MOVE WS-PAGIBIG TO FD-PAGIBIG
        MOVE WS-PHILHEALTH TO FD-PHILHEALTH

        COMPUTE WS-TOTALDEDUCTION = WS-SSS + WS-PAGIBIG +
        WS-PHILHEALTH + WS-LATERES + WS-ABSENTRES + WS-UNDERTIMERES
        MOVE WS-TOTALDEDUCTION TO FD-TOTAL-DEDUCTION

        COMPUTE WS-NETPAY = WS-TOTAL-PAY - WS-TOTALDEDUCTION
        MOVE WS-NETPAY TO FD-NETPAY
            
            REWRITE PAYSLIP-RECORD
               INVALID KEY
                   DISPLAY "ERROR: NO RECORD FOUND"
           END-REWRITE
           DISPLAY "RECORDED SUCCESSFULLY"
           END-READ.
           CLOSE PAYSLIP-FILE.
       
        BACK.
        CALL "SYSTEM" USING BY REFERENCE "python3 Call.py"
        STOP RUN.
        
       PAYSLIP.
       DISPLAY "ENTER USERNAME YOU WANT TO VIEW: " WITH NO ADVANCING
       ACCEPT USERNAME
       OPEN I-O PAYSLIP-FILE
           READ PAYSLIP-FILE KEY IS USERNAME
            INVALID KEY
                DISPLAY "RECORD NOT FOUND FOR USER-ID: " USERNAME
            NOT INVALID KEY
                DISPLAY "ENTER PAYSLIP PERIOD: " WITH NO ADVANCING
                ACCEPT PAYSLIP-PERIOD
                DISPLAY "PAYSLIP PERIOD: " PAYSLIP-PERIOD
                DISPLAY "BASIC PAY: " BASIC-SALARY
                DISPLAY "OVERTIME PAY: " FD-OVERTIME
                DISPLAY "NIGHT DIFFERENTIAL: " FD-NIGHT-DIFF
                DISPLAY "HOLIDAY PAY: " FD-HOLIDAY
                DISPLAY "TOTAL PAY: " FD-TOTAL-PAY
                DISPLAY "SSS: " FD-SSS
                DISPLAY "PAGIBIG: " FD-PAGIBIG
                DISPLAY "PHILHEALTH: " FD-PHILHEALTH
                DISPLAY "LATE/S: " FD-LATE
                DISPLAY "ABSENT/S: " FD-ABSENT
                DISPLAY "UNDERTIME/S: " FD-UNDERTIME
                DISPLAY "TOTAL DEDUCTION: " FD-TOTAL-DEDUCTION
                DISPLAY "NET PAY: " FD-NETPAY
               REWRITE PAYSLIP-RECORD
               INVALID KEY
                   DISPLAY "ERROR: NO RECORD FOUND"
           END-REWRITE
           DISPLAY "GENERATED SUCCESSFULLY"
           END-READ.
           CLOSE PAYSLIP-FILE.
        STOP RUN.
