        IDENTIFICATION DIVISION.
        PROGRAM-ID. EMPLOYEE-FILE.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT EMPLOYEE-FILE
            ASSIGN TO "Employee-rec.dat"
            ORGANIZATION IS LINE SEQUENTIAl
            ACCESS IS SEQUENTIAL.

            SELECT EMPLOYEE-SCHED
            ASSIGN TO "Employee-rec.dat"
            ORGANIZATION IS LINE SEQUENTIAL
            ACCESS IS SEQUENTIAL.
            
        DATA DIVISION.
        FILE SECTION.
       FD EMPLOYEE-FILE.
       01 EMPLOYEE-SPACE.
            02 EMP-SPACE PIC X(3).

       01 EMPLOYEE-RECORD.
            02 EMPLOYEE-FILLER PIC X(6).
            02 EMPLOYEE-NAME PIC X(30).

       01 EMPLOYEE-RECORD1.
            03 EMPLOYEE-FILLER1 PIC X(5).
            03 EMPLOYEE-DOB PIC X(15).

       01 EMPLOYEE-RECORD2.
            04 EMPLOYEE-FILLER2 PIC X(8).
            04 EMPLOYEE-GENDER PIC A(10).

       01 EMPLOYEE-RECORD3.     
            05 EMPLOYEE-FILLER3 PIC X(16).
            05 EMPLOYEE-MARITAL-STATUS PIC A(10).

       01 EMPLOYEE-RECORD4.    
            06 EMPLOYEE-FILLER4 PIC X(13).
            06 EMPLOYEE-NATIONALITY PIC A(10).

       01 EMPLOYEE-RECORD5.    
            07 EMPLOYEE-FILLER5 PIC X(7).
            07 EMPLOYEE-EMAIL PIC X(20).
            
       01 EMPLOYEE-RECORD6.
            08 EMPLOYEE-FILLER6 PIC X(9).
            08 EMPLOYEE-CONTACT PIC Z(12).

       01 EMPLOYEE-RECORD7.    
            09 EMPLOYEE-FILLER7 PIC X(9).
            09 EMPLOYEE-ADDRESS PIC X(40).

        FD EMPLOYEE-SCHED.
        01 EMPLOYEE-SCHEDULE.
            02 EMPLOYEE-ATTENDANCE PIC x(20).
            02 EMPLOYEE-LEAVES PIC 9(10).
            02 EMPLOYEE-PAYSLIP PIC X(30).

        WORKING-STORAGE SECTION.
        01 CHOICE PIC 9(1).
        01 EMPLOYEE-NAME-IN PIC X(30).
        01 EMPLOYEE-DOB-IN PIC X(15).
        01 EMPLOYEE-GENDER-IN PIC A(10).
        01 EMPLOYEE-MARITAL-STATUS-IN PIC A(10).
        01 EMPLOYEE-NATIONALITY-IN PIC A(10).
        01 EMPLOYEE-EMAIL-IN PIC X(20).
        01 EMPLOYEE-CONTACT-IN PIC 9(12).
        01 EMPLOYEE-ADDRESS-IN PIC X(40).
                

        PROCEDURE DIVISION.
        MAIN-PARA.
        PERFORM UNTIL CHOICE = 5
        DISPLAY "EMPLOYEE RECORD MANAGEMENT"
        DISPLAY "1 - ADD/EDIT/DELETE EMPLOYEE RECORD"
        DISPLAY "2 - VIEW EMPLOYEE RECORD"
        DISPLAY "3 - ATTENDANCE"
        DISPLAY "4 - GENERATE PAYSLIP"
        DISPLAY "5 - EXIT"
        DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING
        ACCEPT CHOICE

        EVALUATE CHOICE
        WHEN 1
            PERFORM ADD-EDIT-DELETE
        WHEN 2
            PERFORM VIEW-RECORD
        WHEN 3
            PERFORM ATTENDANCE
        WHEN 4
            PERFORM PAYSLIP
        WHEN 5
            EXIT

        END-PERFORM   
        STOP RUN.

        ADD-EDIT-DELETE.
        DISPLAY "1 - ADD EMPLOYEE RECORD"
        DISPLAY "2 - EDIT EMPLOYEE RECORD"
        DISPLAY "3 - DELETE EMPLOYEE RECORD"
        DISPLAY "4 - BACK"
        DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING
        ACCEPT CHOICE
        
        EVALUATE CHOICE
        WHEN 1
            PERFORM ADD-RECORD
        WHEN 2
            PERFORM EDIT-RECORD
        WHEN 3
            PERFORM DELETE-RECORD
        WHEN 4
            PERFORM MAIN-PARA
        STOP RUN. 

        ADD-RECORD.
            DISPLAY "ENTER EMPLOYEE NAME: " WITH NO ADVANCING
            ACCEPT EMPLOYEE-NAME-IN
            DISPLAY "ENTER EMPLOYEE DOB(mm/dd/yy): " WITH NO ADVANCING
            ACCEPT EMPLOYEE-DOB-IN
            DISPLAY "ENTER EMPLOYEE GENDER(M/F): " WITH NO ADVANCING
            ACCEPT EMPLOYEE-GENDER-IN
            DISPLAY "ENTER EMPLOYEE STATUS(Single, Married, etc): " 
            WITH NO ADVANCING
            ACCEPT EMPLOYEE-MARITAL-STATUS-IN
            DISPLAY "ENTER EMPLOYEE NATIONALITY: " WITH NO ADVANCING
            ACCEPT EMPLOYEE-NATIONALITY-IN
            DISPLAY "ENTER EMPLOYEE EMAIL: " WITH NO ADVANCING
            ACCEPT EMPLOYEE-EMAIL-IN
            DISPLAY "ENTER EMPLOYEE CONTACT: " WITH NO ADVANCING
            ACCEPT EMPLOYEE-CONTACT-IN
            DISPLAY "ENTER EMPLOYEE ADDRESS: " WITH NO ADVANCING
            ACCEPT EMPLOYEE-ADDRESS-IN

        OPEN EXTEND EMPLOYEE-FILE
            MOVE " " TO EMP-SPACE
            WRITE EMPLOYEE-SPACE
            
            MOVE "NAME: " TO EMPLOYEE-FILLER
            MOVE EMPLOYEE-NAME-IN TO EMPLOYEE-NAME
            WRITE EMPLOYEE-RECORD

            MOVE "DOB: " TO EMPLOYEE-FILLER1
            MOVE EMPLOYEE-DOB-IN TO EMPLOYEE-DOB
            WRITE EMPLOYEE-RECORD1
            
            MOVE "GENDER: " TO EMPLOYEE-FILLER2
            MOVE EMPLOYEE-GENDER-IN TO EMPLOYEE-GENDER
            WRITE EMPLOYEE-RECORD2

            MOVE "MARITAL STATUS: " TO EMPLOYEE-FILLER3
            MOVE EMPLOYEE-MARITAL-STATUS-IN TO EMPLOYEE-MARITAL-STATUS
            WRITE EMPLOYEE-RECORD3

            MOVE "NATIONALITY: " TO EMPLOYEE-FILLER4
            MOVE EMPLOYEE-NATIONALITY-IN TO EMPLOYEE-NATIONALITY
            WRITE EMPLOYEE-RECORD4

            MOVE "EMAIL: " TO EMPLOYEE-FILLER5
            MOVE EMPLOYEE-EMAIL-IN TO EMPLOYEE-EMAIL
            WRITE EMPLOYEE-RECORD5

            MOVE "CONTACT: " TO EMPLOYEE-FILLER6
            MOVE EMPLOYEE-CONTACT-IN TO EMPLOYEE-CONTACT
            WRITE EMPLOYEE-RECORD6

            MOVE "ADDRESS: " TO EMPLOYEE-FILLER7
            MOVE EMPLOYEE-ADDRESS-IN TO EMPLOYEE-ADDRESS
            WRITE EMPLOYEE-RECORD7
            END-WRITE
        CLOSE EMPLOYEE-FILE
            
        STOP RUN.

        EDIT-RECORD.

        STOP RUN.

        DELETE-RECORD.

        STOP RUN.

        VIEW-RECORD.
        DISPLAY "1 - VIEW EMPLOYEE RECORD"
        DISPLAY "2 - BACK"
        STOP RUN.

        ATTENDANCE.
        DISPLAY "1 - TIME IN"
        DISPLAY "2 - TIME OUT"
        DISPLAY "3 - LEAVE"
        DISPLAY "4 - BACK"
        STOP RUN.

        PAYSLIP.
        DISPLAY "1 - GENERATE PAYSLIP"
        DISPLAY "2 - BACK"
        STOP RUN.
