       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE-FILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE
           ASSIGN TO "C:\Users\Benny\Documents\GitHub\Payroll-Management-System\Employee-rec.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
           ACCESS IS SEQUENTIAL.

           SELECT EMPLOYEE-SCHED
           ASSIGN TO "C:\Users\Benny\Documents\GitHub\Payroll-Management-System\Employee-rec.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
           ACCESS IS SEQUENTIAL.
           
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE.
       01 EMPLOYEE-RECORD.
           02 EMPLOYEE-NAME PIC X(30).
           02 EMPLOYEE-DOB PIC X(15).
           02 EMPLOYEE-GENDER PIC A(10).
           02 EMPLOYEE-MARITAL-STATUS PIC A(10).
           02 EMPLOYEE-NATIONALITY PIC A(10).
           02 EMPLOYEE-EMAIL PIC X(20).
           02 EMPLOYEE-CONTACT PIC 9(12).
           02 EMPLOYEE-ADDRESS PIC X(40).

       FD EMPLOYEE-SCHED.
       01 EMPLOYEE-SCHEDULE.
           02 EMPLOYEE-ATTENDANCE PIC x(20).
           02 EMPLOYEE-LEAVES PIC 9(10).
           02 EMPLOYEE-PAYSLIP PIC X(30).

       WORKING-STORAGE SECTION.
       01 CHOICE PIC 9(1).

       PROCEDURE DIVISION.
       MAIN-PARA.
       PERFORM UNTIL CHOICE = 5
       DISPLAY "EMPLOYEE RECORD MANAGEMENT"
       DISPLAY "1 - ADD/EDIT/DELETE EMPLOYEE RECORD"
       DISPLAY "2 - VIEW EMPLOYEE RECORD"
       DISPLAY "3 - ATTENDANCE"
       DISPLAY "4 - GENERATE PAYSLIP"
       DISPLAY "5 - EXIT"
       DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING

       WHEN 1
           PERFORM ADD-EDIT-DELETE
       WHEN 2
           PERFORM VIEW-RECORD
       WHEN 3
           PERFORM ATTENDANCE
       WHEN 4
           PERFORM PAYSLIP
       WHEN 5
       STOP RUN.

       ADD-EDIT-DELETE.
       DISPLAY "1 - ADD EMPLOYEE RECORD"
       DISPLAY "2 - EDIT EMPLOYEE RECORD"
       DISPLAY "3 - DELETE EMPLOYEE RECORD"
       DISPLAY "4 - BACK"
       DISPLAY "ENTER YOUR CHOICE: " WITH NO ADVANCING
       STOP RUN. 

       VIEW-RECORD.
       DISPLAY "1 - VIEW EMPLOYEE RECORD"
       DISPLAY "2 - BACK"
       STOP RUN.

       ATTENDANCE.
       DISPLAY "1 - TIME IN"
       DISPLAY "2 - TIME OUT"
       DISPLAY "3 - LEAVE"
       DISPLAY "4 - BACK"
       STOP RUN.

       PAYSLIP.
       DISPLAY "1 - GENERATE PAYSLIP"
       DISPLAY "2 - BACK"
       STOP RUN.
